# Pandas

In [2]:
import pandas as pd

## Series - a one-d labeled array

In [21]:
fruits = ["apple", "pear", "orange", "melon", "kiwi"]
fruits

['apple', 'pear', 'orange', 'melon', 'kiwi']

In [22]:
fruits_pd = pd.Series(["apple", "pear", "orange", "melon", "kiwi"])
fruits

['apple', 'pear', 'orange', 'melon', 'kiwi']

In [24]:
fruits_ind = pd.Series(["apple", "pear", "orange", "melon", "kiwi"], index = [5, 6, "sju", 8, 9])
fruits_ind ["sju"]

'orange'

In [16]:
numbers = pd.Series([5, 6, 3])
numbers

0    5
1    6
2    3
dtype: int64

In [9]:
numbers2 = pd.Series([5, "6", 3])
numbers2

0    5
1    6
2    3
dtype: object

In [17]:
numbers*2 +1

0    11
1    13
2     7
dtype: int64

In [26]:
fruits_pd.apply (str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [27]:
fruits_pd[:2]

0    apple
1     pear
dtype: object

In [28]:
fruits_pd[[True, True, False, False, True]]

0    apple
1     pear
4     kiwi
dtype: object

In [29]:
numbers[numbers>=5]

0    5
1    6
dtype: int64

In [34]:
numbers3 =pd.Series([5,9,2,7,6])

In [35]:
mask = numbers3[numbers>=5]
numbers3[mask]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

## Data Frame

In [36]:
data = {
    "Name": ["Anders", "Thomas", "Mario"],
    "Age": [42, 46, 36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

In [37]:
data = [{"Name": "Anders", "Age": 42},
{"Name": "Thomas", "Age": 46},
{"Name": "Mario", "Age": 36},
]

df2 = pd.DataFrame(data)
df2

     Name  Age
0  Anders   42
1  Thomas   46
2   Mario   36

In [38]:
df["Name"]

0    Anders
1    Thomas
2     Mario
Name: Name, dtype: object

In [39]:
df["Age"]

0    42
1    46
2    36
Name: Age, dtype: int64

In [41]:
df["Age"] + 1 #doesn't update the df, but returns a new series object

0    43
1    47
2    37
Name: Age, dtype: int64

In [46]:
df["Age"] = df["Age"] + 1 #updates the df
df

     Name  Age
0  Anders   47
1  Thomas   51
2   Mario   41

In [47]:
df["Age"] >= 50

0    False
1     True
2    False
Name: Age, dtype: bool

In [48]:
df[df["Age"]>=50]

     Name  Age
1  Thomas   51

In [49]:
str(df)

'     Name  Age\n0  Anders   47\n1  Thomas   51\n2   Mario   41'

In [50]:
print(df)

     Name  Age
0  Anders   47
1  Thomas   51
2   Mario   41